ednieuw/NanoESP32-BW-RGBW-clock/ESP32WordClockUltimatePCB_V028/ESP32WordClockUltimatePCB_V028.ino
/* 
 Author .    : Ed Nieuwenhuys
 Changes V001: Derived from ESP32Arduino_WordClockV035.ino
 Changes V002: SK6812 LEDs working. LDR pin A2 to A6
 Changes V003: HC595coding op pin A0 A1 A2 
 Changes V004: Time function upgraded. Removed RTCLib and added wire commands
 Changes V005: Moved BW and RGB clock defines to TABs
 Changes V006: No errors when compiling with UVBW, NLBW, NL114CLOCK
 Changes V007: No errors in FOURLANGUAGECLOCK
 Changes V008: Rotary, one-wire buttons and DCF77 added, RTC working, DCF77 NOT, One-wire working??
 Changes V009: Clean up. Optimized code and function name and location. 
               Rotary does not place the time in the DS3231   
               DCF77 does not function well with time functions. Try later
 Changes V010: When RGB clock is chosen HC595 shift one place every second. If RGB clock then it can be used to control something
 Changes V011: Clean up. 
 Changes V012: Added WIFI and NTP events. Added in Loop() NTPsyncEvent();
 Changes V013: Ulrich's clock face added #define NLM1M2M3M4L94 #define NLM1M2M3M4L256 and >18 to >19 in SayHour of Ulrich's clock.Clock faces identical as in ESP32ArduinoWordclockV036   
 Changes V014: Renamed to ESP32WordClockUltimatePCB-V014. All clock faces compile without errors
 Changes V015: Added   <meta name="google" content="notranslate" /> in Webpage.h
 Changes V016: Coding moved to relevant header files. Source compile for all clock selections        
 Changes V017: Reverted back to V015. The RGBW LED functions should remain in primary source code. M1M2M3M4 in BW clock. BWUV clock to Ulrich Vertessen for testing 
 Changes V018: Compiles with board esp32-> Arduino Nano ESP32 -> By GPIO number.  Added MIN0; to clear the four RGB(W) LEDs       
 Changes V019: Removed Colour display choice from menu with BW clocks
 Changes V020: Removed command WiFi.mode(WIFI_STA); 
 Changes V021: DS3231 use tested and status can be seen in menu. Corrected 2000 year mismatch in DS3231
 Changes V022: Changed PCB and ESP32 LEDs to analog control of the intensity
 Changes V024: Menu changed!! Rotary working again. Added void InitRotaryMod(void)
 Changes V025: CCC in menu to turn on/off BLE. Code synced with ESP32Arduino_WordClockV046 
 Changes V026: Added Rotary On/Off choice and scan WIFI network in menu. BLE delay(40) -> 10 Comparable with ESP32Arduino_WordClockV054 
 Changes V027: Fine tuned WIFIwasConnected. Removed NLM1M2M3M4L256. Comparable with ESP32Arduino_WordClockV055 
 Changes V028: Corrected when LEDs are turned on in EveryHour to force a minute update


*** Special designed for ESP32 Ultimate PCB with shift registers and RGB(W) support *** 

How to compile: 

Check if #define ELEGANTOTA_USE_ASYNC_WEBSERVER 1 in ElegantOTA.h
Locate the ELEGANTOTA_USE_ASYNC_WEBSERVER macro in the ElegantOTA.h file, and set it to 1: -->  #define ELEGANTOTA_USE_ASYNC_WEBSERVER 1

Install Arduino Nano ESP32 boards
Board: Arduino Nano ESP32
Partition Scheme: With FAT
Pin Numbering: By GPIO number (legacy)

Select below, with ONLY ONE #define selected, the clock type
Upload the file to the Arduino Nano ESP32 installed on PCB "Nano ESP32 Word clock"

*/
// =============================================================================================================================
//--------------------------------------------
// ESP32 Definition of preferred word clock type
// Define the clock type by removing the // before the #define
//--------------------------------------------

// ------------------>   Define ONLY ONE clock type!

//#define NL144CLOCK               // RGB(W) Standard 12x12 clock
//#define FOURLANGUAGECLOCK      // RGB(W) 4-languages clock
//#define NLM1M2M3M4L94          // NL clock with four extra LEDs for the minutes to light up for Ulrich
 
//#define NLBW                   // NL White LEDs clock with HC595 Shift bit registers for control
//#define UKBW                   // UK White LEDs clock with HC595 Shift bit registers for control
#define UVBW                   // Ulrich White LEDs clock + M1M2M3M4 with HC595 Shift bit registers for control

//--------------------------------------------
// ESP32 Definition of installed modules
// Define the modules installed in the clock by removing the // before the #define
//--------------------------------------------
//#define ONEWIREKEYPAD3x1       // Use a 3x1 keypad with one wire
//#define ONEWIREKEYPAD3x4       // Use a 3x4 keypad with one wire

//#define DCF77MOD               // DCF77 installed. Does not work together with NTPtime!!. Remove NTP time functionality to use the DCF77

//--------------------------------------------
// ESP32 Includes defines and initialisations
//--------------------------------------------

#include <Preferences.h>
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
#include "EdSoftLED.h"         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812. Uses RMT driver
                      #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel  for LED strip WS2812 or SK6812
                      #endif
#include <NimBLEDevice.h>      // For BLE communication  https://github.com/h2zero/NimBLE-Arduino
#include <ESPNtpClient.h>      // https://github.com/gmag11/ESPNtpClient
#include <WiFi.h>              // Used for web page 
#include <AsyncTCP.h>          // Used for webpage  https://github.com/dvarrel/AsyncTCP                    old https://github.com/me-no-dev/ESPAsyncWebServer
#include <ESPAsyncWebServer.h> // Used for webpage  https://github.com/mathieucarbou/ESPAsyncWebServer     Old one with  https://github.com/me-no-dev/ESPAsyncWebServer
#include <ElegantOTA.h>        // If a large bunch of compile error see here :https://docs.elegantota.pro/async-mode
                               // Locate the ELEGANTOTA_USE_ASYNC_WEBSERVER macro in the ElegantOTA.h file, and set it to 1:
                               // #define ELEGANTOTA_USE_ASYNC_WEBSERVER 1
#include <Wire.h>              // Used for I2C 
#include <Encoder.h>
                      #ifdef DCF77MOD
#include <DCF77.h>
#include <TimeLib.h>
                      #endif //DCF77MOD


                      #if defined(FOURLANGUAGECLOCK) || defined(NL144CLOCK) || defined( NLM1M2M3M4L94)
#define RGBCLOCK
                      #endif
                      #if defined(NLBW) || defined(UKBW)  || defined(UVBW)  
#define BWCLOCK
                      #endif
//--------------------------------------------
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;

