ednieuw/NanoESP32-BW-RGBW-clock/ESP32WordClockUltimatePCB_V028/ESP32WordClockUltimatePCB_V028.ino
#define DS3231_I2C_ADDRESS          0x68
#define DS3231_TEMPERATURE_MSB      0x11
#define DS3231_TEMPERATURE_LSB      0x12
//                                  #ifdef MOD_DS3231
RTC_DS3231 RTCklok; 
DateTime Inow;
byte DS3231Installed = 0;                                                                     // True if the DS3231 is detected

//--------------------------------------------                                                //
// KY-040 ROTARY
//--------------------------------------------                   
Encoder myEnc(encoderPinA, encoderPinB);                                                      // Use digital pin  for encoder 
long     Looptime          = 0;
byte     RotaryPress       = 0;                                                               // Keeps track of display choice and how often the rotary is pressed.
uint32_t RotaryPressTimer  = 0;
byte     NoofRotaryPressed = 0;

//--------------------------------------------                                                //
// LDR PHOTOCELL
//--------------------------------------------
//                                                                                            //
const byte SLOPEBRIGHTNESS    = 80;                                                           // Steepness of with luminosity of the LED increases
const int  MAXBRIGHTNESS      = 255;                                                          // Maximun value in bits  for luminosity of the LEDs (1 - 255)
const byte LOWBRIGHTNESS      = 5;                                                            // Lower limit in bits of Brightness ( 0 - 255)   
byte       TestLDR            = 0;                                                            // If true LDR inf0 is printed every second in serial monitor
int        OutPhotocell;                                                                      // stores reading of photocell;
int        MinPhotocell       = 999;                                                          // stores minimum reading of photocell;
int        MaxPhotocell       = 1;                                                            // stores maximum reading of photocell;
uint32_t   SumLDRreadshour    = 0;
uint32_t   NoofLDRreadshour   = 0;

//--------------------------------------------                                                //
// DCF-2 DCF77 MODULE  #include <DCF77.h> 
//--------------------------------------------
byte DCF_signal = 50;                                                                         // Is a proper time received?
byte DCF_counts = 0;                                                                          // Valid DCF receptions per hour
bool SeeDCFsignalInDisplay = false;                                                           // If ON then the display line HET IS WAS will show the DCF77-signal received
bool UseDCF                = true;                                                            // Use the DCF-receiver or not
                                  #ifdef DCF77MOD                                             // DCF77 ------------------------------
#define DCF_INTERRUPT 0                                                                       // DCF Interrupt number associated with DCF_PIN
DCF77 DCF = DCF77(DCF_PIN,DCF_INTERRUPT,LOW);
                                  #endif //DCF77MOD  

//--------------------------------------------                                                //
// CLOCK initialysations
//--------------------------------------------                                 

static uint32_t msTick;                                                                       // Number of millisecond ticks since we last incremented the second counter
byte      lastminute = 0, lasthour = 0, lastday = 0, sayhour = 0;
byte      Display1 = 0 , Display2 = 0, Display3 = 0;
bool      Demo                 = false;
bool      Zelftest             = false;
bool      Is                   = true;                                                        // toggle of displaying Is or Was
bool      ZegUur               = true;                                                        // Say or not say Uur in NL clock
struct    tm timeinfo;                                                                        // Storage of time used in clock for time display

//--------------------------------------------                                                //
// BLE   #include <NimBLEDevice.h>
//--------------------------------------------
BLEServer *pServer      = NULL;
BLECharacteristic * pTxCharacteristic;
bool deviceConnected    = false;
bool oldDeviceConnected = false;
std::string ReceivedMessageBLE;

#define SERVICE_UUID           "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"                         // UART service UUID
#define CHARACTERISTIC_UUID_RX "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"
#define CHARACTERISTIC_UUID_TX "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"

//----------------------------------------
// WIFI and webserver
//----------------------------------------
bool SSIDandNetworkfound = false;                                                             // True if Mem.SSID and a found WIFI.scan'ed network are identical
bool WIFIwasConnected = false;                                                                   // Is wIFI connected?
AsyncWebServer server(80);                                                                    // For OTA Over the air uploading
#include "Webpage.h"


//--------------------------------------------                                                //
// NTP #include <ESPNtpClient.h>
//--------------------------------------------
boolean syncEventTriggered = false;                                                           // True if a time even has been triggered
NTPEvent_t ntpEvent;                                                                          // Last triggered event

//--------------------------------------------                                                //
// One-wire keypad
//--------------------------------------------
 bool     ChangeTime           = false;
 bool     ChangeLightIntensity = false;
 bool     KeyInputactivated    = false;
 uint64_t KeyLooptime          = 0;
 String   KeypadString         ="";
//--------------------------------------------                                                //
// Common
//--------------------------------------------
#define MAXTEXT 255
bool      SerialConnected      = true;   
bool      LEDsAreOff           = false;                                                       // If true LEDs are off except time display
bool      NoTextInLeds         = false;                                                       // Flag to control printing of the text in function ColorLeds() and ShiftInTime()
byte      Toggle_HetWasIs      = 1;  
char      sptext[MAXTEXT];                                                                    // For common print use 
int       Previous_LDR_read    = 512;                                                         // The actual reading from the LDR + 4x this value /5
int       ToggleEdsoft         = 1;
uint16_t  MilliSecondValue     = 10;                                                          // The duration of a second  minus 1 ms. Used in Demo mode
uint64_t  Loopcounter          = 0;

